#  7数据清洗和准备

In [4]:
import pandas as pd
import numpy as np

In [5]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan,'avocado'])

In [6]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [7]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [8]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [11]:
from numpy import nan as NA
data = pd.Series([1,NA,3.5,NA,7])

In [12]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [13]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [14]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
....: [NA, NA, NA], [NA, 6.5, 3.]])

In [15]:
cleaned = data.dropna()

In [16]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [18]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [19]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [20]:
data[4]=NA

In [21]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [22]:
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [23]:
df = pd.DataFrame(np.random.randn(7,3))

In [25]:
df.iloc[:4,1]=NA
df

          0         1         2
0 -1.150516       NaN -0.344132
1 -0.355315       NaN  0.817442
2  1.399605       NaN -0.390583
3  0.331754       NaN  0.402780
4 -0.223710  0.323266  2.254553
5 -0.174712 -1.596251 -0.967812
6 -0.203983  0.202545  0.081608

In [26]:
df.iloc[:2,2]=NA

In [27]:
df

          0         1         2
0 -1.150516       NaN       NaN
1 -0.355315       NaN       NaN
2  1.399605       NaN -0.390583
3  0.331754       NaN  0.402780
4 -0.223710  0.323266  2.254553
5 -0.174712 -1.596251 -0.967812
6 -0.203983  0.202545  0.081608

In [28]:
df.dropna()

          0         1         2
4 -0.223710  0.323266  2.254553
5 -0.174712 -1.596251 -0.967812
6 -0.203983  0.202545  0.081608

In [29]:
df.dropna(thresh=2)

          0         1         2
2  1.399605       NaN -0.390583
3  0.331754       NaN  0.402780
4 -0.223710  0.323266  2.254553
5 -0.174712 -1.596251 -0.967812
6 -0.203983  0.202545  0.081608

In [30]:
df.fillna(0)

          0         1         2
0 -1.150516  0.000000  0.000000
1 -0.355315  0.000000  0.000000
2  1.399605  0.000000 -0.390583
3  0.331754  0.000000  0.402780
4 -0.223710  0.323266  2.254553
5 -0.174712 -1.596251 -0.967812
6 -0.203983  0.202545  0.081608

In [31]:
df.fillna({1:0.5,2:0})

          0         1         2
0 -1.150516  0.500000  0.000000
1 -0.355315  0.500000  0.000000
2  1.399605  0.500000 -0.390583
3  0.331754  0.500000  0.402780
4 -0.223710  0.323266  2.254553
5 -0.174712 -1.596251 -0.967812
6 -0.203983  0.202545  0.081608

In [33]:
_ = df.fillna(0,inplace=True)

In [34]:
df

          0         1         2
0 -1.150516  0.000000  0.000000
1 -0.355315  0.000000  0.000000
2  1.399605  0.000000 -0.390583
3  0.331754  0.000000  0.402780
4 -0.223710  0.323266  2.254553
5 -0.174712 -1.596251 -0.967812
6 -0.203983  0.202545  0.081608

In [45]:
df = pd.DataFrame(np.random.randn(6, 3))

In [46]:
df.iloc[2:, 1] = NA

In [47]:
df.iloc[4:, 2] = NA

In [48]:
df

          0         1         2
0 -0.433479 -0.325037  0.142217
1  0.665909  1.741188  0.716437
2  0.297794       NaN -0.135024
3 -1.943406       NaN -0.750511
4  0.128431       NaN       NaN
5  1.004359       NaN       NaN

In [49]:
df.fillna(method='ffill')

          0         1         2
0 -0.433479 -0.325037  0.142217
1  0.665909  1.741188  0.716437
2  0.297794  1.741188 -0.135024
3 -1.943406  1.741188 -0.750511
4  0.128431  1.741188 -0.750511
5  1.004359  1.741188 -0.750511

In [51]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -0.433479 -0.325037  0.142217
1  0.665909  1.741188  0.716437
2  0.297794  1.741188 -0.135024
3 -1.943406  1.741188 -0.750511
4  0.128431       NaN -0.750511
5  1.004359       NaN -0.750511

In [53]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [54]:
 data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [55]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'], 'k2': [1, 1, 2, 3, 3, 4, 4]})

In [56]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [57]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [58]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [59]:
data['V1'] = range(7)

In [60]:
data.drop_duplicates(['k1'])

    k1  k2  V1
0  one   1   0
1  two   1   1

In [61]:
data.drop_duplicates(['k1','k2'],keep='last')

    k1  k2  V1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [63]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork',
'bacon', 'Pastrami', 'corned beef',
'Bacon','pastrami', 'honey ham', 'novalox'],'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5,
6]})

In [64]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8      novalox     6.0

In [73]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'novalox': 'salmon'
}

In [74]:
lowercased = data['food'].str.lower()

In [75]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8        novalox
Name: food, dtype: object

In [76]:
data['animal']=lowercased.map(meat_to_animal)

In [77]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8      novalox     6.0  salmon

In [78]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [79]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [81]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [83]:
data.replace([-999,-1000], [np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [84]:
data.replace({-999:np.nan, -1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [86]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
 index=['Ohio', 'Colorado', 'New York'],
 columns=['one', 'two', 'three', 'four'])

In [87]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [88]:
transform = lambda x: x[:4].upper()

In [89]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [90]:
data.index = data.index.map(transform)

In [91]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [92]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [93]:
data.rename(index={'OHIO': 'INDIANA'},columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [94]:
data.rename(index={'OHIO':'INDIANA'}, inplace=True)

In [95]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [98]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [102]:
bins=[18,25,35,60,100]

In [103]:
cats = pd.cut(ages,bins)

In [104]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [105]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [106]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [107]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [108]:
pd.cut(ages,[18,26,36,61,100],right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [109]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged',
'Senior']

In [111]:
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [112]:
data = np.random.rand(20)

In [113]:
pd.cut(data, 4, precision=2)

[(0.29, 0.51], (0.51, 0.73], (0.064, 0.29], (0.064, 0.29], (0.73, 0.95], ..., (0.73, 0.95], (0.73, 0.95], (0.51, 0.73], (0.73, 0.95], (0.29, 0.51]]
Length: 20
Categories (4, interval[float64]): [(0.064, 0.29] < (0.29, 0.51] < (0.51, 0.73] < (0.73, 0.95]]

In [114]:
data = np.random.randn(1000)

In [115]:
cats = pd.qcut(data, 4)

In [116]:
cats

[(-0.758, -0.0692], (-0.758, -0.0692], (-0.0692, 0.661], (-0.0692, 0.661], (-2.874, -0.758], ..., (-0.0692, 0.661], (-0.758, -0.0692], (-0.0692, 0.661], (-0.758, -0.0692], (-0.0692, 0.661]]
Length: 1000
Categories (4, interval[float64]): [(-2.874, -0.758] < (-0.758, -0.0692] < (-0.0692, 0.661] < (0.661, 3.547]]

In [117]:
pd.value_counts(cats)

(0.661, 3.547]       250
(-0.0692, 0.661]     250
(-0.758, -0.0692]    250
(-2.874, -0.758]     250
dtype: int64

In [118]:
pd.qcut(data, [0,0.1,0.5,0.9,1.])

[(-1.295, -0.0692], (-1.295, -0.0692], (-0.0692, 1.271], (-0.0692, 1.271], (-2.874, -1.295], ..., (-0.0692, 1.271], (-1.295, -0.0692], (-0.0692, 1.271], (-1.295, -0.0692], (-0.0692, 1.271]]
Length: 1000
Categories (4, interval[float64]): [(-2.874, -1.295] < (-1.295, -0.0692] < (-0.0692, 1.271] < (1.271, 3.547]]

In [119]:
data = pd.DataFrame(np.random.randn(1000,4))

In [121]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.001509    -0.020538     0.004763    -0.007769
std       1.027840     1.003010     1.000922     1.007278
min      -3.121816    -2.983051    -3.316709    -3.122785
25%      -0.670141    -0.693103    -0.669322    -0.689427
50%       0.026977     0.055083     0.011170    -0.016610
75%       0.684812     0.627500     0.680357     0.659738
max       3.048901     3.222679     3.508244     3.676430

In [122]:
data

            0         1         2         3
0    0.758652  0.813561 -0.477011 -0.268725
1    0.889573  2.299217 -1.973022 -0.774935
2    0.275905  1.012378  0.533860  1.367058
3   -1.648209 -0.146931  0.228081 -0.902706
4    1.376050  0.985824  0.047098  1.400010
5    1.262619  2.000131 -0.730849  1.381054
6    2.020549  1.193932  0.793522 -0.715762
7   -1.041407  0.557504 -0.061922 -0.482114
8    0.441966  0.223915 -0.170886  0.068930
9   -1.090380 -0.375354  0.292460 -0.148606
10  -0.201006 -0.493436 -1.076254  0.970810
11  -1.722193  0.745564  1.158633 -0.703076
12  -0.680425  1.935357 -0.236641 -0.227121
13   1.332893  0.692834 -0.610373 -0.962463
14  -0.157514  0.879250  0.314931  0.564364
15  -1.061903 -2.035332 -0.113058  1.795115
16  -0.484327 -0.111124 -0.870770 -1.860574
17  -1.149056 -0.570976  0.611339  0.305810
18   0.148649 -0.202391 -0.059906  0.726162
19   1.516943 -1.420982  1.166013  1.416204
20   0.367557  0.424252  2.413805 -1.774405
21   0.138192 -1.089903 -0.064400 -0.225316
22  -0.169400 -1.163050 -0.609647  0.240076
23   0.247237 -0.636497  0.636673  1.675726
24  -0.568853  0.321888  0.572878 -2.144508
25   0.892928 -0.251580  0.292854 -1.866135
26  -0.287507 -0.132184 -0.542566  1.363160
27   0.379667  0.278243 -0.378811 -1.177124
28   1.041029 -0.044419 -1.525017 -0.240931
29   0.716602 -1.329768  0.669455 -0.585514
..        ...       ...       ...       ...
970 -0.612572  0.800519 -0.919698 -1.282244
971  1.024823 -2.148826 -2.540308 -0.399344
972  1.439550 -0.662229  1.015437  0.782180
973  0.450828  1.287628  0.065284 -0.546206
974 -0.440552 -0.518706  0.661577 -0.839227
975 -0.820377  0.183684  1.179119  3.108468
976  0.520182  1.441954  0.447282  1.388305
977  0.137923  0.355379 -0.724200 -0.704927
978  0.448898 -0.845496 -0.973906 -0.385885
979 -3.121816 -0.587024  0.952363 -1.056534
980 -1.082818  1.221283 -0.102510 -0.418793
981  1.171201  0.783356 -0.876179  0.529345
982  0.737776 -1.080442 -1.377692  0.130461
983  0.775014  0.268026 -0.393180  1.889031
984 -1.578393  0.278300  1.172305 -0.033144
985  0.716637 -0.332288 -0.483551 -1.257169
986 -1.257160  0.431599 -0.709526  0.135034
987  0.368912  0.317250 -1.511036  0.182999
988 -0.540445  0.893686 -0.465386 -0.740616
989 -2.512001 -0.374180  0.528180 -0.322037
990 -1.866024  0.241366 -2.230094  0.013255
991 -0.686816 -1.157053 -0.455163 -0.218950
992 -0.705145 -1.095764  0.067164  1.004662
993 -0.757086 -0.282480  0.678925  0.148006
994  1.184102 -2.173671  0.775654 -0.514723
995 -0.095303 -0.860091  0.805120  0.313033
996  0.138141 -0.254630 -0.392073  0.658531
997 -1.737472 -1.036438  1.270412 -2.448845
998 -0.640353  1.468230 -0.774429  1.444416
999  1.939195  0.335753 -0.348492  0.035972

[1000 rows x 4 columns]

In [123]:
col = data[2]

In [125]:
col[np.abs(col)>3]

194   -3.316709
685   -3.114040
964    3.508244
Name: 2, dtype: float64

In [128]:
data[(np.abs(data)>3).any(1)]

            0         1         2         3
194 -0.987356  1.699259 -3.316709  0.270167
273  1.285121 -2.764481 -1.084243  3.283819
301 -0.551449  2.178661 -1.157145  3.149998
326 -3.039175  0.838014 -0.316201  0.310131
364 -0.866674  0.174547 -0.972306 -3.122785
413  0.515970  3.203155 -1.526244 -0.892164
610  0.754227  0.136517  0.346041  3.676430
685 -0.984691  0.733249 -3.114040  0.857031
851  3.048901 -1.009548  0.511426  0.944871
910  1.816290  3.222679  1.710981  2.014050
964  0.357923  0.033812  3.508244  1.090859
975 -0.820377  0.183684  1.179119  3.108468
979 -3.121816 -0.587024  0.952363 -1.056534

In [131]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [132]:
data

            0         1         2         3
0    0.758652  0.813561 -0.477011 -0.268725
1    0.889573  2.299217 -1.973022 -0.774935
2    0.275905  1.012378  0.533860  1.367058
3   -1.648209 -0.146931  0.228081 -0.902706
4    1.376050  0.985824  0.047098  1.400010
5    1.262619  2.000131 -0.730849  1.381054
6    2.020549  1.193932  0.793522 -0.715762
7   -1.041407  0.557504 -0.061922 -0.482114
8    0.441966  0.223915 -0.170886  0.068930
9   -1.090380 -0.375354  0.292460 -0.148606
10  -0.201006 -0.493436 -1.076254  0.970810
11  -1.722193  0.745564  1.158633 -0.703076
12  -0.680425  1.935357 -0.236641 -0.227121
13   1.332893  0.692834 -0.610373 -0.962463
14  -0.157514  0.879250  0.314931  0.564364
15  -1.061903 -2.035332 -0.113058  1.795115
16  -0.484327 -0.111124 -0.870770 -1.860574
17  -1.149056 -0.570976  0.611339  0.305810
18   0.148649 -0.202391 -0.059906  0.726162
19   1.516943 -1.420982  1.166013  1.416204
20   0.367557  0.424252  2.413805 -1.774405
21   0.138192 -1.089903 -0.064400 -0.225316
22  -0.169400 -1.163050 -0.609647  0.240076
23   0.247237 -0.636497  0.636673  1.675726
24  -0.568853  0.321888  0.572878 -2.144508
25   0.892928 -0.251580  0.292854 -1.866135
26  -0.287507 -0.132184 -0.542566  1.363160
27   0.379667  0.278243 -0.378811 -1.177124
28   1.041029 -0.044419 -1.525017 -0.240931
29   0.716602 -1.329768  0.669455 -0.585514
..        ...       ...       ...       ...
970 -0.612572  0.800519 -0.919698 -1.282244
971  1.024823 -2.148826 -2.540308 -0.399344
972  1.439550 -0.662229  1.015437  0.782180
973  0.450828  1.287628  0.065284 -0.546206
974 -0.440552 -0.518706  0.661577 -0.839227
975 -0.820377  0.183684  1.179119  3.000000
976  0.520182  1.441954  0.447282  1.388305
977  0.137923  0.355379 -0.724200 -0.704927
978  0.448898 -0.845496 -0.973906 -0.385885
979 -3.000000 -0.587024  0.952363 -1.056534
980 -1.082818  1.221283 -0.102510 -0.418793
981  1.171201  0.783356 -0.876179  0.529345
982  0.737776 -1.080442 -1.377692  0.130461
983  0.775014  0.268026 -0.393180  1.889031
984 -1.578393  0.278300  1.172305 -0.033144
985  0.716637 -0.332288 -0.483551 -1.257169
986 -1.257160  0.431599 -0.709526  0.135034
987  0.368912  0.317250 -1.511036  0.182999
988 -0.540445  0.893686 -0.465386 -0.740616
989 -2.512001 -0.374180  0.528180 -0.322037
990 -1.866024  0.241366 -2.230094  0.013255
991 -0.686816 -1.157053 -0.455163 -0.218950
992 -0.705145 -1.095764  0.067164  1.004662
993 -0.757086 -0.282480  0.678925  0.148006
994  1.184102 -2.173671  0.775654 -0.514723
995 -0.095303 -0.860091  0.805120  0.313033
996  0.138141 -0.254630 -0.392073  0.658531
997 -1.737472 -1.036438  1.270412 -2.448845
998 -0.640353  1.468230 -0.774429  1.444416
999  1.939195  0.335753 -0.348492  0.035972

[1000 rows x 4 columns]

In [133]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.001621    -0.020964     0.004685    -0.008865
std       1.027218     1.001680     0.997915     1.002969
min      -3.000000    -2.983051    -3.000000    -3.000000
25%      -0.670141    -0.693103    -0.669322    -0.689427
50%       0.026977     0.055083     0.011170    -0.016610
75%       0.684812     0.627500     0.680357     0.659738
max       3.000000     3.000000     3.000000     3.000000

In [134]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0 -1.0 -1.0
1  1.0  1.0 -1.0 -1.0
2  1.0  1.0  1.0  1.0
3 -1.0 -1.0  1.0 -1.0
4  1.0  1.0  1.0  1.0

In [135]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [137]:
sampler = np.random.permutation(5)

In [140]:
sampler

array([0, 1, 3, 4, 2])

In [141]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [142]:
df.take(sampler)

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
3  12  13  14  15
4  16  17  18  19
2   8   9  10  11

In [143]:
choices = pd.Series([5, 7, -1, 6, 4])

In [144]:
choices

0    5
1    7
2   -1
3    6
4    4
dtype: int64

In [146]:
draws = choices.sample(n=10, replace=True)
draws

1    7
2   -1
0    5
4    4
4    4
3    6
4    4
2   -1
3    6
2   -1
dtype: int64

In [147]:
 df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
.....: 'data1': range(6)})

In [148]:
df

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   b

In [149]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [150]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [151]:
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [153]:
df_with_dummy = df[['data1']].join(dummies)

In [154]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [155]:
mnames = ['movie_id', 'title','genres']

In [170]:
movies = pd.read_table('D:/Datewhale/Datawhale/datasets/movielens/movies.dat',sep='::', header=None, names=mnames)

F:\Anaconda\lib\site-packages\ipykernel_launcher.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  """Entry point for launching an IPython kernel.

In [172]:
movies[0:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [173]:
all_genres = []

In [174]:
for x in movies.genres:
    all_genres.extend(x.split('|'))

In [177]:
genres=pd.unique(all_genres)

In [178]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [179]:
zero_matrix = np.zeros((len(movies),len(genres)) )

In [180]:
dummies = pd.DataFrame(zero_matrix, columns = genres)

In [181]:
gen = movies.genres[0]

In [182]:
gen

"Animation|Children's|Comedy"

In [184]:
gen.split('|')

['Animation', "Children's", 'Comedy']

In [185]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2], dtype=int64)

In [186]:
for i, gen in enumerate(movies.genres):
     indices = dummies.columns.get_indexer(gen.split('|'))
     dummies.iloc[i, indices] = 1

In [187]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))

In [188]:
 movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
Genre_Action                                   0
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Name: 0, dtype: object

In [189]:
np.random.seed(12345)

In [191]:
values = np.random.rand(10)

In [192]:
values

array([ 0.92961609,  0.31637555,  0.18391881,  0.20456028,  0.56772503,
        0.5955447 ,  0.96451452,  0.6531771 ,  0.74890664,  0.65356987])

In [193]:
bins = [0,0.2,0.4,0.6,0.8,1]

In [194]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

In [195]:
val = 'a, b, guido'

In [196]:
val.split(',')

['a', ' b', ' guido']

In [197]:
pieces = [x.strip() for x in val.split(',')]

In [198]:
pieces

['a', 'b', 'guido']

In [199]:
first, second, third = pieces

In [200]:
 first + '::' + second + '::' + third

'a::b::guido'

In [201]:
'::'.join(pieces)

'a::b::guido'

In [202]:
'guido' in val

True

In [203]:
val.index(',')

1

In [204]:
val.find(':')

-1

In [205]:
val.index(':')

ValueError: substring not found

In [207]:
val.count(',')

2

In [208]:
val.replace(',','::')

'a:: b:: guido'

In [211]:
val.replace(',','')

'a b guido'

In [212]:
data = {'Dave': 'dave@google.com', 'Steve':
'steve@gmail.com',
'Rob': 'rob@gmail.com', 'Wes': np.nan}

In [213]:
data = pd.Series(data)

In [214]:
data

Dave     dave@google.com
Rob        rob@gmail.com
Steve    steve@gmail.com
Wes                  NaN
dtype: object

In [215]:
data.isnull()

Dave     False
Rob      False
Steve    False
Wes       True
dtype: bool

In [216]:
data.str.contains('gmail')

Dave     False
Rob       True
Steve     True
Wes        NaN
dtype: object